In [1]:
import numpy as np
import pandas as pd

# 值的连接 merge

In [4]:
df1 = pd.DataFrame({'Name':['San Zhang','Si Li'], 'Age':[20,30]})
df1

        Name  Age
0  San Zhang   20
1      Si Li   30

In [5]:
df2 = pd.DataFrame({'Name':['Si Li','Wu Wang'], 'Gender':['F','M']})
df2

      Name Gender
0    Si Li      F
1  Wu Wang      M

In [6]:
df1.merge(df2, on='Name', how='left')

        Name  Age Gender
0  San Zhang   20    NaN
1      Si Li   30      F

In [7]:
df1 = pd.DataFrame({'df1_name':['San Zhang','Si Li'], 'Age':[20,30]})
df1

    df1_name  Age
0  San Zhang   20
1      Si Li   30

In [8]:
df2 = pd.DataFrame({'df2_name':['Si Li','Wu Wang'], 'Gender':['F','M']})
df2

  df2_name Gender
0    Si Li      F
1  Wu Wang      M

In [9]:
df1.merge(df2, left_on="df1_name", right_on="df2_name", how="right")

  df1_name   Age df2_name Gender
0    Si Li  30.0    Si Li      F
1      NaN   NaN  Wu Wang      M

## how{‘left’, ‘right’, ‘outer’, ‘inner’, ‘cross’}, default ‘inner’

In [10]:
df1 = pd.DataFrame({"df1_name":["Amy","Tony","Larry","David","Tobi"],"Height":[163,183,173,182,191]})
df1

  df1_name  Height
0      Amy     163
1     Tony     183
2    Larry     173
3    David     182
4     Tobi     191

In [11]:
df2 = pd.DataFrame({"df2_name":["Tobi","David","Ken","Vova","Steve","Amy","Leana"],"Weight":[75,82,67,62,73,52,55]})
df2

  df2_name  Weight
0     Tobi      75
1    David      82
2      Ken      67
3     Vova      62
4    Steve      73
5      Amy      52
6    Leana      55

### merge will create duplicate columns when left_on right_on different columns names, use drop("columnname", axis=1)

In [14]:
df1.merge(df2, left_on="df1_name",right_on="df2_name",how="inner").drop("df2_name", axis=1)

  df1_name  Height  Weight
0      Amy     163      52
1    David     182      82
2     Tobi     191      75

In [15]:
df1.merge(df2, left_on="df1_name",right_on="df2_name",how="outer").drop("df2_name", axis=1)

  df1_name  Height  Weight
0      Amy   163.0    52.0
1     Tony   183.0     NaN
2    Larry   173.0     NaN
3    David   182.0    82.0
4     Tobi   191.0    75.0
5      NaN     NaN    67.0
6      NaN     NaN    62.0
7      NaN     NaN    73.0
8      NaN     NaN    55.0

In [16]:
df1.merge(df2, left_on="df1_name",right_on="df2_name",how="left").drop("df2_name", axis=1)

  df1_name  Height  Weight
0      Amy     163    52.0
1     Tony     183     NaN
2    Larry     173     NaN
3    David     182    82.0
4     Tobi     191    75.0

In [18]:
df1.merge(df2, left_on="df1_name",right_on="df2_name",how="right").drop("df1_name", axis=1)

   Height df2_name  Weight
0   191.0     Tobi      75
1   182.0    David      82
2     NaN      Ken      67
3     NaN     Vova      62
4     NaN    Steve      73
5   163.0      Amy      52
6     NaN    Leana      55

## how to reorder columns for table above?

#### use reindex
#### use rename (columns={"old1":new1, old2:new2, old3:new3 })

In [27]:
df_reorder = df1.merge(df2, left_on="df1_name",right_on="df2_name",how="right").drop("df1_name", axis=1)
df_reorder.reindex(["df2_name","Height","Weight"],axis=1).rename(columns={"df2_name":"Name"})
df_toSave = df_reorder.reindex(["df2_name","Height","Weight"],axis=1).rename(columns={"df2_name":"Name"})
df_toSave

    Name  Height  Weight
0   Tobi   191.0      75
1  David   182.0      82
2    Ken     NaN      67
3   Vova     NaN      62
4  Steve     NaN      73
5    Amy   163.0      52
6  Leana     NaN      55

In [ ]:
df_toSave.to_csv()